{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input": {"name": "input_example_tensor:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "outputs": {"outputs": {"name": "gpt2_1/wte_final_einsum/ExpandDims:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}, "inputs": {"name": "Reshape:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}}, "modelTopology": {"node": [{"name": "gpt2_1/ln_f/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/ln_f/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h1/mlp/conv1d_main/c_proj/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/mlp/mul_4/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/mlp/add_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/mlp/mul_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/mlp/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/norm_2/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/norm_2/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2/h1/attn/compute_output_bias/o_b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h1/attn/q", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h1/attn/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/ExpandDims_5/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h1/attn/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2/h1/attn/k", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h1/attn/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2_1/h1/attn/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/sub_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/attn/ExpandDims_4/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/attn/ExpandDims_6/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h1/norm_1/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h1/norm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul_4/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/add_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2/h0/mlp/mul_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2/h0/norm_2/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h0/norm_2/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2/h0/attn/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2/h0/attn/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/ExpandDims_3/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h0/attn/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h0/attn/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2/h0/attn/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/ExpandDims_4/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/transpose_3/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2/h0/attn/ExpandDims_5/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_2/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h1/norm_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h1/attn/Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2_1/h1/attn/sub_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/norm_1/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/norm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_proj/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/mlp/mul_4/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/mlp/add_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/mlp/mul_3/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/mlp/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/norm_2/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/norm_2/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/compute_output_bias/o_b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h0/attn/q", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h0/attn/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_5/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h0/attn/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/k", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "gpt2_1/h0/attn/ExpandDims_2/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "gpt2_1/h0/attn/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}}}, {"name": "gpt2_1/h0/attn/sub_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_4/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/ExpandDims_6/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_1/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2/Gather/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/pos_embd/Gather", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/sub_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/norm_1/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/norm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/Gather/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/wpe", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/pos_embd/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/pos_embd/Gather/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/norm_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h0/norm_1/g", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h0/attn/v", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h0/attn/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_3/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h0/attn/Reshape_3/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gpt2/h0/attn/o", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h0/norm_2/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_2/g", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "3072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_proj/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/norm_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2/h1/norm_1/g", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h1/norm_1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h1/attn/v", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/h1/attn/Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "gpt2_1/h1/attn/ExpandDims_3/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "NotEqual/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/attn/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/attn/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gpt2_1/h1/attn/Reshape_3/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gpt2/h1/attn/o", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/norm_2/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/h1/norm_2/g", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h1/norm_2/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/h1/mlp/conv1d_main/c_fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "3072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h1/mlp/conv1d_main/c_fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h1/mlp/conv1d_main/c_proj/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/ln_f/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gpt2/ln_f/g", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "gpt2/ln_f/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gpt2/wte", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "768"}]}}}}}, {"name": "gpt2_1/wte_final_einsum/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_example_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Reshape", "op": "Reshape", "input": ["input_example_tensor", "Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "gpt2/Gather", "op": "GatherV2", "input": ["gpt2/wte", "Reshape", "gpt2/Gather/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "NotEqual", "op": "NotEqual", "input": ["Reshape", "NotEqual/y"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "gpt2/pos_embd/add", "op": "AddV2", "input": ["gpt2/Gather", "gpt2/pos_embd/Gather"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cast_1", "op": "Cast", "input": ["NotEqual"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_1/Mean", "op": "Mean", "input": ["gpt2/pos_embd/add", "gpt2/h0/norm_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "Sum", "op": "Sum", "input": ["Cast_1", "Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "gpt2/h0/norm_1/sub", "op": "Sub", "input": ["gpt2/pos_embd/add", "gpt2/h0/norm_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/sub_2", "op": "Sub", "input": ["Sum", "gpt2_1/h1/attn/sub_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/sub_2", "op": "Sub", "input": ["Sum", "gpt2_1/h0/attn/sub_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2_1/sub", "op": "Sub", "input": ["Sum", "gpt2_1/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2_1/pos_embd/sub", "op": "Sub", "input": ["Sum", "gpt2_1/pos_embd/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/sub", "op": "Sub", "input": ["Sum", "gpt2_1/h0/attn/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/sub", "op": "Sub", "input": ["Sum", "gpt2_1/h1/attn/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_1/Square", "op": "Square", "input": ["gpt2/h0/norm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/GatherV2", "op": "GatherV2", "input": ["mul", "gpt2_1/h1/attn/sub_2", "gpt2_1/h1/attn/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/GatherV2", "op": "GatherV2", "input": ["mul", "gpt2_1/h0/attn/sub_2", "gpt2_1/h0/attn/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "gpt2_1/GatherV2", "op": "GatherV2", "input": ["Reshape", "gpt2_1/sub", "gpt2_1/GatherV2/axis"], "attr": {"batch_dims": {"i": "1"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "gpt2_1/pos_embd/Gather", "op": "GatherV2", "input": ["gpt2/wpe", "gpt2_1/pos_embd/sub", "gpt2_1/pos_embd/Gather/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/one_hot", "op": "OneHot", "input": ["gpt2_1/h0/attn/sub", "gpt2_1/h0/attn/one_hot/depth", "gpt2_1/h0/attn/one_hot/on_value", "gpt2_1/h0/attn/one_hot/off_value"], "attr": {"TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}}}, {"name": "gpt2_1/h1/attn/one_hot", "op": "OneHot", "input": ["gpt2_1/h1/attn/sub", "gpt2_1/h1/attn/one_hot/depth", "gpt2_1/h1/attn/one_hot/on_value", "gpt2_1/h1/attn/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_1/Mean_1", "op": "Mean", "input": ["gpt2/h0/norm_1/Square", "gpt2/h0/norm_1/Mean_1/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/ExpandDims_4", "op": "ExpandDims", "input": ["gpt2_1/h1/attn/GatherV2", "gpt2_1/h1/attn/ExpandDims_4/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_4", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/GatherV2", "gpt2_1/h0/attn/ExpandDims_4/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/Gather", "op": "GatherV2", "input": ["gpt2/wte", "gpt2_1/GatherV2", "gpt2_1/Gather/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "gpt2_1/h0/attn/ExpandDims", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/one_hot", "gpt2_1/h0/attn/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h1/attn/ExpandDims", "op": "ExpandDims", "input": ["gpt2_1/h1/attn/one_hot", "gpt2_1/h1/attn/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/add", "op": "AddV2", "input": ["gpt2/h0/norm_1/Mean_1", "gpt2/h0/norm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/pos_embd/add", "op": "AddV2", "input": ["gpt2_1/Gather", "gpt2_1/pos_embd/Gather"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_1", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/ExpandDims", "gpt2_1/h0/attn/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/ExpandDims_1", "op": "ExpandDims", "input": ["gpt2_1/h1/attn/ExpandDims", "gpt2_1/h1/attn/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/Rsqrt", "op": "Rsqrt", "input": ["gpt2/h0/norm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/Mean", "op": "Mean", "input": ["gpt2_1/pos_embd/add", "gpt2_1/h0/norm_1/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/sub_1", "op": "Sub", "input": ["gpt2_1/h0/attn/sub_1/x", "gpt2_1/h0/attn/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h1/attn/sub_1", "op": "Sub", "input": ["gpt2_1/h1/attn/sub_1/x", "gpt2_1/h1/attn/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/mul", "op": "Mul", "input": ["gpt2/h0/norm_1/Rsqrt", "gpt2/h0/norm_1/g"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/sub", "op": "Sub", "input": ["gpt2_1/pos_embd/add", "gpt2_1/h0/norm_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/mul_1", "op": "Mul", "input": ["gpt2/h0/norm_1/mul", "gpt2/h0/norm_1/sub"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/Square", "op": "Square", "input": ["gpt2_1/h0/norm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_1/add_1", "op": "AddV2", "input": ["gpt2/h0/norm_1/mul_1", "gpt2/h0/norm_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/Mean_1", "op": "Mean", "input": ["gpt2_1/h0/norm_1/Square", "gpt2_1/h0/norm_1/Mean_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "gpt2/h0/attn/MatMul", "op": "BatchMatMulV2", "input": ["gpt2/h0/norm_1/add_1", "gpt2/h0/attn/q"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "gpt2/h0/attn/MatMul_1", "op": "BatchMatMulV2", "input": ["gpt2/h0/norm_1/add_1", "gpt2/h0/attn/k"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "adj_x": {"b": false}}}, {"name": "gpt2/h0/attn/MatMul_2", "op": "BatchMatMulV2", "input": ["gpt2/h0/norm_1/add_1", "gpt2/h0/attn/v"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/add", "op": "AddV2", "input": ["gpt2_1/h0/norm_1/Mean_1", "gpt2_1/h0/norm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Reshape", "op": "Reshape", "input": ["gpt2/h0/attn/MatMul", "gpt2/h0/attn/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Reshape_1", "op": "Reshape", "input": ["gpt2/h0/attn/MatMul_1", "gpt2/h0/attn/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Reshape_2", "op": "Reshape", "input": ["gpt2/h0/attn/MatMul_2", "gpt2/h0/attn/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/norm_1/Rsqrt", "op": "Rsqrt", "input": ["gpt2_1/h0/norm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/ExpandDims_2", "op": "ExpandDims", "input": ["gpt2/h0/attn/Reshape", "gpt2/h0/attn/ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/transpose", "op": "Transpose", "input": ["gpt2/h0/attn/Reshape_1", "gpt2/h0/attn/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/mul", "op": "Mul", "input": ["gpt2/h0/attn/Reshape_1", "gpt2_1/h0/attn/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/transpose_3", "op": "Transpose", "input": ["gpt2/h0/attn/Reshape_2", "gpt2/h0/attn/transpose_3/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/mul_2", "op": "Mul", "input": ["gpt2/h0/attn/Reshape_2", "gpt2_1/h0/attn/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/mul", "op": "Mul", "input": ["gpt2_1/h0/norm_1/Rsqrt", "gpt2_1/h0/norm_1/sub"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/ExpandDims_3", "op": "ExpandDims", "input": ["gpt2/h0/attn/transpose", "gpt2/h0/attn/ExpandDims_3/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/ExpandDims_5", "op": "ExpandDims", "input": ["gpt2/h0/attn/transpose_3", "gpt2/h0/attn/ExpandDims_5/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/mul_1", "op": "Mul", "input": ["gpt2_1/h0/norm_1/mul", "gpt2/h0/norm_1/g"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/mul", "op": "Mul", "input": ["gpt2/h0/attn/ExpandDims_2", "gpt2/h0/attn/ExpandDims_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_1/add_1", "op": "AddV2", "input": ["gpt2_1/h0/norm_1/mul_1", "gpt2/h0/norm_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Sum", "op": "Sum", "input": ["gpt2/h0/attn/mul", "gpt2/h0/attn/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "gpt2_1/h0/attn/MatMul", "op": "MatMul", "input": ["gpt2_1/h0/norm_1/add_1", "gpt2/h0/attn/q"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "gpt2_1/h0/attn/MatMul_1", "op": "MatMul", "input": ["gpt2_1/h0/norm_1/add_1", "gpt2/h0/attn/k"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/MatMul_2", "op": "MatMul", "input": ["gpt2_1/h0/norm_1/add_1", "gpt2/h0/attn/v"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "gpt2/h0/attn/transpose_1", "op": "Transpose", "input": ["gpt2/h0/attn/Sum", "gpt2/h0/attn/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/Reshape", "op": "Reshape", "input": ["gpt2_1/h0/attn/MatMul", "gpt2_1/h0/attn/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/Reshape_1", "op": "Reshape", "input": ["gpt2_1/h0/attn/MatMul_1", "gpt2_1/h0/attn/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/Reshape_2", "op": "Reshape", "input": ["gpt2_1/h0/attn/MatMul_2", "gpt2_1/h0/attn/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/add", "op": "AddV2", "input": ["gpt2/h0/attn/transpose_1", "gpt2/h0/attn/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_5", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/Reshape", "gpt2_1/h0/attn/ExpandDims_5/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_2", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/Reshape_1", "gpt2_1/h0/attn/ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_3", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/Reshape_2", "gpt2_1/h0/attn/ExpandDims_3/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Softmax", "op": "Softmax", "input": ["gpt2/h0/attn/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/mul_1", "op": "Mul", "input": ["gpt2_1/h0/attn/ExpandDims_2", "gpt2_1/h0/attn/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/mul_3", "op": "Mul", "input": ["gpt2_1/h0/attn/ExpandDims_3", "gpt2_1/h0/attn/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/transpose_2", "op": "Transpose", "input": ["gpt2/h0/attn/Softmax", "gpt2/h0/attn/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/add", "op": "AddV2", "input": ["gpt2_1/h0/attn/mul", "gpt2_1/h0/attn/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/add_1", "op": "AddV2", "input": ["gpt2_1/h0/attn/mul_2", "gpt2_1/h0/attn/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/ExpandDims_4", "op": "ExpandDims", "input": ["gpt2/h0/attn/transpose_2", "gpt2/h0/attn/ExpandDims_4/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/transpose", "op": "Transpose", "input": ["gpt2_1/h0/attn/add", "gpt2_1/h0/attn/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/transpose_1", "op": "Transpose", "input": ["gpt2_1/h0/attn/add_1", "gpt2_1/h0/attn/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/attn/mul_1", "op": "Mul", "input": ["gpt2/h0/attn/ExpandDims_4", "gpt2/h0/attn/ExpandDims_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/mul_4", "op": "Mul", "input": ["gpt2_1/h0/attn/ExpandDims_5", "gpt2_1/h0/attn/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Sum_1", "op": "Sum", "input": ["gpt2/h0/attn/mul_1", "gpt2/h0/attn/Sum_1/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "gpt2_1/h0/attn/Sum", "op": "Sum", "input": ["gpt2_1/h0/attn/mul_4", "gpt2_1/h0/attn/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/Reshape_3", "op": "Reshape", "input": ["gpt2/h0/attn/Sum_1", "gpt2/h0/attn/Reshape_3/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/add_2", "op": "AddV2", "input": ["gpt2_1/h0/attn/Sum", "gpt2_1/h0/attn/ExpandDims_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/attn/MatMul_3", "op": "BatchMatMulV2", "input": ["gpt2/h0/attn/Reshape_3", "gpt2/h0/attn/o"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/Softmax", "op": "Softmax", "input": ["gpt2_1/h0/attn/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["gpt2/pos_embd/add", "gpt2/h0/attn/MatMul_3"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "gpt2_1/h0/attn/ExpandDims_6", "op": "ExpandDims", "input": ["gpt2_1/h0/attn/Softmax", "gpt2_1/h0/attn/ExpandDims_6/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["gpt2/h0/attn/compute_output_bias/o_b", "gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "gpt2_1/h0/attn/mul_5", "op": "Mul", "input": ["gpt2_1/h0/attn/ExpandDims_6", "gpt2_1/h0/attn/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/Mean", "op": "Mean", "input": ["gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_add", "gpt2/h0/norm_2/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "gpt2_1/h0/attn/Sum_1", "op": "Sum", "input": ["gpt2_1/h0/attn/mul_5", "gpt2_1/h0/attn/Sum_1/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "gpt2/h0/norm_2/sub", "op": "Sub", "input": ["gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_add", "gpt2/h0/norm_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/Reshape_3", "op": "Reshape", "input": ["gpt2_1/h0/attn/Sum_1", "gpt2_1/h0/attn/Reshape_3/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/Square", "op": "Square", "input": ["gpt2/h0/norm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/attn/MatMul_3", "op": "MatMul", "input": ["gpt2_1/h0/attn/Reshape_3", "gpt2/h0/attn/o"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "gpt2/h0/norm_2/Mean_1", "op": "Mean", "input": ["gpt2/h0/norm_2/Square", "gpt2/h0/norm_2/Mean_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "gpt2_1/h0/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["gpt2_1/pos_embd/add", "gpt2_1/h0/attn/MatMul_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "gpt2/h0/norm_2/add", "op": "AddV2", "input": ["gpt2/h0/norm_2/Mean_1", "gpt2/h0/norm_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["gpt2/h0/attn/compute_output_bias/o_b", "gpt2_1/h0/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "gpt2/h0/norm_2/Rsqrt", "op": "Rsqrt", "input": ["gpt2/h0/norm_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/Mean", "op": "Mean", "input": ["gpt2_1/h0/ArithmeticOptimizer/AddOpsRewrite_add", "gpt2_1/h0/norm_2/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/mul", "op": "Mul", "input": ["gpt2/h0/norm_2/Rsqrt", "gpt2/h0/norm_2/g"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/sub", "op": "Sub", "input": ["gpt2_1/h0/ArithmeticOptimizer/AddOpsRewrite_add", "gpt2_1/h0/norm_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/mul_1", "op": "Mul", "input": ["gpt2/h0/norm_2/mul", "gpt2/h0/norm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2_1/h0/norm_2/Square", "op": "Square", "input": ["gpt2_1/h0/norm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/norm_2/add_1", "op": "AddV2", "input": ["gpt2/h0/norm_2/mul_1", "gpt2/h0/norm_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/Mean_1", "op": "Mean", "input": ["gpt2_1/h0/norm_2/Square", "gpt2_1/h0/norm_2/Mean_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_fc_1/MatMul", "op": "BatchMatMulV2", "input": ["gpt2/h0/norm_2/add_1", "gpt2/h0/mlp/conv1d_main/c_fc/kernel"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/add", "op": "AddV2", "input": ["gpt2_1/h0/norm_2/Mean_1", "gpt2_1/h0/norm_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/conv1d_main/c_fc_1/add", "op": "AddV2", "input": ["gpt2/h0/mlp/conv1d_main/c_fc_1/MatMul", "gpt2/h0/mlp/conv1d_main/c_fc/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/Rsqrt", "op": "Rsqrt", "input": ["gpt2_1/h0/norm_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul_4", "op": "Mul", "input": ["gpt2/h0/mlp/mul_4/x", "gpt2/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul", "op": "Mul", "input": ["gpt2/h0/mlp/mul/x", "gpt2/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/ArithmeticOptimizer/ReplaceMulWithSquare_mul_1", "op": "Square", "input": ["gpt2/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/mul", "op": "Mul", "input": ["gpt2_1/h0/norm_2/Rsqrt", "gpt2_1/h0/norm_2/sub"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul_2", "op": "Mul", "input": ["gpt2/h0/mlp/mul", "gpt2/h0/mlp/ArithmeticOptimizer/ReplaceMulWithSquare_mul_1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2_1/h0/norm_2/mul_1", "op": "Mul", "input": ["gpt2_1/h0/norm_2/mul", "gpt2/h0/norm_2/g"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/add", "op": "AddV2", "input": ["gpt2/h0/mlp/conv1d_main/c_fc_1/add", "gpt2/h0/mlp/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/norm_2/add_1", "op": "AddV2", "input": ["gpt2_1/h0/norm_2/mul_1", "gpt2/h0/norm_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/mul_3", "op": "Mul", "input": ["gpt2/h0/mlp/mul_3/x", "gpt2/h0/mlp/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/mlp/conv1d_main/c_fc_1/MatMul", "op": "MatMul", "input": ["gpt2_1/h0/norm_2/add_1", "gpt2/h0/mlp/conv1d_main/c_fc/kernel"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/Tanh", "op": "Tanh", "input": ["gpt2/h0/mlp/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/mlp/conv1d_main/c_fc_1/add", "op": "AddV2", "input": ["gpt2_1/h0/mlp/conv1d_main/c_fc_1/MatMul", "gpt2/h0/mlp/conv1d_main/c_fc/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/mlp/add_1", "op": "AddV2", "input": ["gpt2/h0/mlp/add_1/x", "gpt2/h0/mlp/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/mlp/mul_4", "op": "Mul", "input": ["gpt2_1/h0/mlp/mul_4/x", "gpt2_1/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "gpt2_1/h0/mlp/mul", "op": "Mul", "input": ["gpt2_1/h0/mlp/mul/x", "gpt2_1/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2_1/h0/mlp/ArithmeticOptimizer/ReplaceMulWithSquare_mul_1", "op": "Square", "input": ["gpt2_1/h0/mlp/conv1d_main/c_fc_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2/h0/mlp/mul_5", "op": "Mul", "input": ["gpt2/h0/mlp/mul_4", "gpt2/h0/mlp/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2_1/h0/mlp/mul_2", "op": "Mul", "input": ["gpt2_1/h0/mlp/mul", "gpt2_1/h0/mlp/ArithmeticOptimizer/ReplaceMulWithSquare_mul_1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "gpt2/h0/mlp/conv1d_main_1/c_proj_1/MatMul", "op": "BatchMatMulV2", "input": ["gpt2/h0/mlp/mul_5", "gpt2/h0/mlp/conv1d_main/c_proj/kernel"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "gpt2_1/h0/mlp/add", "op": "AddV2", "input": ["gpt2_1/h0/mlp/conv1d_main/c_fc_1/add", "gpt2_1/h0/mlp/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_1", "op": "AddN", "input": ["gpt2/h0/ArithmeticOptimizer/AddOpsRewrite_add", "gpt2/h0/mlp/conv1d_main_1/c_proj_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, 